# 今天主要讲
# IT 行业的主要问题
# 1，买包
# 搞一些华而不实的东西
# 微软出 .net
# 2，减肥药
# 搞一些东西，声称可以有效解决（几乎）一切问题
# 3，出斧头

# 书

# 1，各个语言
'''
C
1970 年发明，主要用于 Unix 操作系统的开发
最接近硬件的编程语言
现在主要用于底层编程（操作系统、嵌入式）
好处是运行效率高
坏处是编程难度大

C++
80 年代
面向对象，支持很多编程范式（方式）的语言
运行效率非常高，和 C 持平
学习曲线很陡峭
微软主推
现在主要用于 游戏领域的基础设施开发（因为需要效率）

Java
90 年代由 Sun 公司发明的减肥药
宣称 一次编写、到处运行
对 C++ 的改进
实际上全是臆想
现在已经沦为外包开发领域专用的骗人垃圾语言了

C#
微软山寨的 Java
实际上学了几乎完全没用，因为市面上用到的地方很少
不过从语言的角度来看，比 Java 好太多了
但是没人关心你好不好

JavaScript
90 年代最初只是十天设计出来的一个随便应付一下的语言
但是历史的进程让它现在成为世界上最流行的编程语言了
现在主要用于 Web 前端开发
也有用于后端（妄想）

PHP
90 年代只是几个业余的码农写出来的 C 语言扩展
现在已经是世界上流行语言中最垃圾的语言了
垃圾到无以复加，无法形容

Python
90 年代出来一个用于教学的编程语言
因为极度简单方便所以现在非常流行
主要用于除了 C 语言的各个方面
也用于嵌入开发逻辑，魔兽世界的服务器就是 Python 写的

Ruby
90 年代日本人做的一个编程语言
通常用来和 Python 相比
实际上呢，它更灵活、更复杂
现在主要只是用在 Web 后端的 RoR 框架中
Ruby on Rails 是一个 Web 后端开发框架

Lua
90 年代巴西人发明的一个给业余玩家用的编程语言
特点是小巧、灵活、方便和 C 语言集成
现在主要用于应用程序的扩展比如软件、游戏等的扩展
魔兽世界的界面、很多游戏的逻辑、Adobe 公司系列软件的编写

Perl
早期的一门脚本语言，特点是内置了功能强大的正则表达式
适合处理文本
现在已经几乎没有人用了
如果还有人用

R
号称是适合统计的语言

Lisp
早期的语言，现在编程语言从它身上借鉴了非常多的概念和功能
这是一类语言的统称
现在流行的主要有
Racket  Facebook 的 VR 开发平台用的语言
Scheme  主要用于教学的简单语言

Haskell
学校里会用来做学术的语言
复杂、功能强大

Erlang
爱立信出的一门编程语言
在国内主要是垃圾页游公司在用作服务器开发

Go
谷歌造的减肥药
号称是xx的服务器开发语言
实际上呢，你不是想去当教主坛主 就别碰

Objective-C
80 年代对 C 语言的扩展，类似于 C++
但是开发理念不一样
在当时是很先进的语言
现在是苹果的官方开发语言（20 多年了）

Swift
苹果的减肥药
目前处于传教的阶段
'''


# 2，各个编程的方向
'''
1，桌面应用程序开发（运行在操作系统上给普通人用的软件）
    QQ
    浏览器
    现在的手机软件也属于这个领域
    没前途

2，游戏编程（包括桌面游戏、主机游戏、手机游戏、网页游戏）
    开发的内容和开发模式都不一样
    苦 累 脏
    没前途

3，系统编程
    在操作系统上做底层开发，衔接上下游的
    开发工具
    没前途

4，嵌入式编程（汽车控制程序、NASA 火箭、洗衣机控制、广告牌、物联网、各种垃圾）
    最恶心的坑
    资源匮乏、工具垃圾
    纯粹的垃圾
    绝对没有任何前途
    前几年 Nokia Moto 裁员，员工都跪了

5，网络应用程序开发（Web）
    简而言之就是写网站
    分前端和后端
    前端就是用 JavaScript 给浏览器页面写程序的
    后端就是操作、处理、返回数据给客户端的程序
    编写简单、舒心、性价比高
    唯一值得推荐的行业

6，企业开发（分内部 In-House 和外包）
    内部就是大公司里面的 IT 部门
    外包则是最垃圾的存在
    绝对不会有任何前途
    人性扭曲之所
'''


# 推荐几本书
'''
《人月神话》
《人件》
《代码大全》
《程序开发心理学》
'''


# 普通人不能预测历史


# 大公司技术成型和分析
'''
# 百度
当年用 C 语言写贴吧
后来有好事者用 PHP 于是现在百度的风气就是 PHP

# 淘宝
最初用 PHP 外包
后来用 Java 外包
所以现在淘宝出去的人都特别迷信 Java
现在是 PHP Java Node.js（不在浏览器上运行的 JavaScript）
三派斗争中

# 网易
不知道是不是因为同在杭州的关系
也是用 Java 的

# 腾讯
服务器因为是写 IM 起家的
所以用 C++

# 新浪
PHP，野鸡公司代表

# Facebook
用 PHP 因为扎克伯格用 php 写的初版

# Twitter Github
用 RoR 成功了

# Stack Overflow
很另类 用了 C#

# 谷歌
搞东搞西，跟微软学的
很多技术都是为了骗人 捆绑 说扔就扔
Dart
Silver Light
XNA

'''


'''
教徒众人拾柴

现在的流行技术、语言 大多是教徒的杰作
实际上并不是他们说的那样
你去观察历史
会发现就是一种循环。。。


我们要做好任何事情
都应该用理智分析 用事实去思考
不要因为信仰做一些奇怪的事情
那样是逆历史潮流而动


## 语言的分类
这些分类都是没有严格定义的


# 动态语言
主要是说可以在语言运行期间动态地做一些事情的语言
比如动态设置类属性、更改函数定义

# 脚本语言
主要是编写简单的语言（实际上有污名化的嫌疑）

# 编译型语言
需要用编译器编译成二进制机器码
然后才能执行

# 解释型语言
一般说来是需要解释器直接解释执行
但是现在的解释型语言都是会有动态编译为机器码的过程（JIT 或者 AOT）
所以其实都很。。。混合了

'''
