# 课 12 作业
#
# 最后一课


# 1
# 写下你掌握的技能和熟练/理解程度
'''
掌握了完成一件项目的时候要懂得将一件很难的事情细分，每个步骤分出来，实现自己
然后组合，就能实现一个复杂的功能的思想，理解的话还是比较理解的，不过实际运用的时候
能不能分，分不分的好，就不一定了。

学会怎么写漂亮的代码，虽然不一定能写好，不过知道什么代码才是漂亮的

了解了魔法方法这个东西，不能熟练使用，要用的时候肯定要差文档，不过查了文档应该能做出需要的功能。

对市面上一些热门的东西有了一个定位，知道有的东西不要盲目跟风。

了解了解释器的一些东西，要写出来还有一定难度不过知道了这并不是什么唬人的东西

会用Turtle画图了

知道了字符是怎么显示在屏幕上的

学会了Python怎么来写链表什么的，一开始我只会用c写= =
'''


# 2
# 写下你接下来的计划(想用编程做什么)

'''
这个还真不知道怎么写，目前就是喜欢编程吧，真要想用编程做什么的话，我想一想
首先，web前端是想稍微学一下的，这个东西容易有成就感，不过我感觉好像比较简单
然后，主要是后端啦，关于什么高并发呀，分布式呀，听说很厉害，不过简单的写个接口操作下数据库什么的，当然也是要的啦
对了，关于之前萧大说的web框架这个，非常有兴趣呀。
其他的话，可以用编程写一些小东西给自己用用什么的，我觉得挺好的，爬点数据分析分析什么的，有机会的话想了解了解机器学习什么的
以上
'''
# 以便提供指导